package com.laharisongs.util;

import java.util.HashMap;
import java.util.Map;

public class IndexNameConstant {

    public static final String[] SofR = {"அதிகாலையில் உம்மைத் தேடுவேன்", "அருணோதயம் ஜெபிக்கிறேன்", "அதோ பார் ஆதிபலியைப் பார்", "அன்பே அன்பே", "அன்பனே மகா அன்பனே", "அநாதி தேவன் உன் அடைக்கலமே",
            "அன்பரின் இனிய நாமமதை", "அகராதியில் அடங்குமோ நின் புகழ்", "அறியாயோ மனமே", "அன்பின் நிறைவே உன்னை", "அறவழி காட்டும் ஆதி மெய் குருவே", "அன்பின் சொரூபியே லஹரி ராஜாவே", "அல்லாஹூ அக்பர்",
            "ஆதியிலே என்னுடன்", "ஆதியில் அன்பு கூர்ந்தவர்", "ஆ எந்தன் பாக்கியத்தை எண்ணிடவே", "ஆனந்தமாய் இன்ப கானான்", "ஆனந்தமே உன்னைப் பாடும் வேளையே", "ஆதிமூலமே ஆதி புருஷனே", "ஆதி பரம புருஷரான லஹரி தேவனே",
            "ஆதியில் பலியான கிறிஸ்துவின் அன்பு", "இறங்கிய தேவனின் நாமமறிய", "இன்பமானதே உந்தன் மகிமை சந்நிதி", "இவ்வுலக அன்பு மாயை", "இறைவா இறைவா இறைவா லஹரி தேவா", "இறைவனே தலைவன் என்று",
            "இறைவா இறைவா நின் புகழ் பாட", " இறைவா நின் பாதம் என் கண்கள்", "இறைவனிடம் கையேந்துங்கள்", "உன்னதமானவரின்", "உன்னதமானவரான கிறிஸ்துவுக்கே மகிமை", "உயிரோடிருந்து நான் விசுவாசிக்க",
            "உம் வார்த்தை என்னை வழி நடத்தும்", "உன்னில் நான் இன்பம் கண்டேன் இறைவா", "உன்னதமானவரே அதிசயமானவரே", "உந்தன் அன்பு தந்ததெனக்கு", "உன் நாமம் தியானிக்கும் வேளை", "உன் சொந்த சித்தத்தை விட்டு",
            "உம் கையில் என்னை என் தேவா", "உன்னை பாடுமே என் நெஞ்சமே", "உந்தன் மாதயவை", "உன்னதமானவரே ஆ... நீர் என்னுடையவரே", "உலகத்தில் நான் உன்னருளை", "எனக்கொத்தாசை வரும்",
            "என் தேவனாகிய கர்த்தாவே உமக்கு", "என்னை மறவா லஹரி நாதா", "என் தேவனை நான் நம்புவேன்", "எங்கள் தேவனாகிய கர்த்தர் ஒருவரே", "என் இதயம் பாடுதே", "என் இதயமே நீ மகிழ்ந்திரு",
            "எல்லாம் வல்ல பரம்பொருளான தேவனே", "என் தாழ்விலே என்னை நினைத்த  தேவா", "என் தேவா லஹரி தேவா", "என் தேவா ஹரி லஹரி", "என் இறைவா உன்னத தேவா", "என் மன்னவா என் இதயத்தில் வாழ்பவா",
            "எனது மனமே கலங்கிடாதே", "என் லஹரியே பரஞ்ஜோதியே", "என் நெஞ்சிலே", "என் பெலனாகிய தேவனே", "என்னென்று சொல்வேன் என் தேவா", "என் ஜீவனே என் கானமே", "என் இதயம் உன்னை நாடுதே",
            "எங்கள் இறைவனே நீதி தேவனே", "என்றும் மாறா கிருபையை", "எல்லையில்லா இறைவனே", "என் கிறிஸ்துவே நீர் நிலையானவர்", "என்றும் ஜீவிக்கும் லஹரி தேவன்", "எழும்பி பிரகாசி", "என் நேசரே நீர் என்னுடையோர்",
            "ஓம் நாராயண குருவே", "ஓம் என்ற சொல்லுக்கு பொருளும் நீயே", "ஓய்வு நாளைக் கடைபிடிப்போம்", "ஓய்வு நாளின் பாட்டாகிய சங்கீதத்தால்", "ஓ... அல்லா... யா அல்லா ரகுமானே", "கர்த்தாதி கர்த்தா என் தேவா",
            "கர்த்தர் என் மேய்ப்பராய் இருக்கிறாரே", " கர்த்தரை நான் எந்த காலத்திலுமே", "கருணை திரு கருணை", "கர்த்தரைத் துதிப்போமே அவர் நல்லவர்", "காலமோ செல்லுதே", "காலை நேரம் உந்தன் சந்நிதி வந்து நிற்கின்றேன்",
            "காலையும் மாலையும் எவ்வேளையும்", "கானம் பாடுதே லஹரி", "கிறிஸ்து நீர் என் நித்திய பங்கு", " கிறிஸ்துவே என் நேசரே", "கிறிஸ்துவே உம்மை தியானிப்பது இனிமையானதே", "கிறிஸ்தேசுவே என் ராஜாவே",
            "கீதையை அளித்த கண்ணனே", "குருதேவா.. குருதேவா", "கைகளால் பெயர்க்கப்படாத பெருங்கல்", "சத்தியம் ஜீவன் மோட்சம் லஹரி", "சீர்மிகு வான்புவி தேவா ஸ்தோத்ரம்", "சீயோனின் மணவாளனே",
            "சீயோனிலே என் திட அஸ்திபாரம்", "சேனைகளின் கர்த்தரே", "சேனையதிபன் நம் கர்த்தருக்கே", "ஞானம் தந்த குருவே", "தண்ணீரைக் கடந்திடும் போது", "திருவருள் தேடி தேடி", "துதியே துதியே துதியே துதியே",
            "துதிப்பேன் துதிப்பேன் முழு மனதாலேயே", "துதியுங்கள் கர்த்தரைத் துதியுங்கள்", "துதிசெய்... துதிசெய்", "துதி பாடுவேன்", "தூய தூய தேவனை", "தேவனே உமது கிருபையை", "தேவனை நம்பி இருக்கிறேன்",
            "தேவ கிருபை என்றுமுள்ளது", "தேவன் நமக்கு அடைக்கலமும்", "தேவாதி தேவா குருதேவா", "தேவா நின் இனிய அன்பே", "தேவா உம் அன்பு நித்தியமே", "தேவா.... என் தேவா", "தேவாதி தேவா என் தேவா",
            "தேவா உந்தன் சமுகத்தில்", "தேவாதி தேவா மகிமையின் ராஜா", "தேவனை உயர்த்தி துதியுங்கள்", "தேவ அன்பின் இனிமை", "தேவனைத் துதிப்பேன்", "நன்றியாலே உள்ளம் பொங்கிடுதே", "நம் இறைவன் ஜீவிக்கின்றவர்",
            "நம் தேவைகளை சந்தித்து நடத்தும்", "நாராயாண நமோ நாராயணா", "நின் நாமமே என் கானமே", "நித்ய ஒய்வு அளித்திட்ட தேவா", "நேச மணாளன் மனுஷகுமாரன்", "நேசரின் அன்பை நினைக்கையிலே",
            "பறக்குதே பாரெல்லாம் அன்புக்கொடி", "பரம்பொருளே... பரம்பொருளே", "பரலோக இராஜ்ஜியம் வந்தது", "பரிசுத்தனே என் வாழ்வின் செல்வமே", "பரமவாசா என் இதய வாசா", "பல பல யுகங்களின் தேவன்", "பலமளித்தெம்மை",
            "புகழ்ந்தே பாடுவேன் எக்காலமும்", "பூரண வடிவுள்ள சீயோனிலே", " பொங்குதே என் உள்ளமே", "போற்றுவோம் நம் தேவனை", "மதுரகீதமே ஆ...", "மண்ணில் வந்த பரம்பொருளை", "மண்ணும் விண்ணும் காத்தருளும்",
            "மனம் நாடும் மணவாளனே", "மகத்துவமானவனே தேவ தேவனே", "மரணத்தை வென்றவா லஹரி ஹரி", "மகிமை சொரூபியே கிறிஸ்தய்யா", "மகிமை மகிமை அடைவோம்", "மகிமையடைவோம் தேவன்பால்",
            "மான்கள் நீரோடை வாஞ்சித்து கதறும் போல்", "மாதவா மாதவா", "மாசில்லாத என் ஆத்ம நேசா", "முதன்மையானவனே ஆ...", "முதல்வானவா முடிவானவா", "யார் இந்த மகிமையின் ராஜா", "லஹரி தேவனே என் ஜீவனின் பெலனும்",
            "லஹரி தேவா உம் அன்பை", "லஹரியே உன்னை பாடும்போது", "லஹரியின் திருநாமம்", "வாழ்த்துங்கள் தேவனை", "வாழ்க வாழ்க கிறிஸ்து ராயரே", "வானங்கள் தேவனின் மகிமையையும்", "வானமும் பூமியும் ஒழிந்திடினும்",
            "வார்த்தையும் தேவனும் ஒன்று", "வாழ்த்துகிறேன் லஹரி ராஜா", "வானங்களும் வானாதி வானங்களுமே", "ஜாதிகளே சகல சிருஷ்டிகளே", "ஜீவிக்கின்ற தேவன் என்றும்", "ஜீவிக்கும் வார்த்தையே", "ஜெகமதில் உதித்த ஜெய ஜோதியே",
            "ஜெயம் கொள்பவன் எவனோ", "ஸ்ரீ லஹரி ராஜா சருவேஸ்வரா", "ஸ்ரீ லஹரி நாம சங்கீர்த்தனம்", "ஸ்தோத்திரம் ஸ்தோத்திரம் ஸ்தோத்திரமே", "ஸ்தோத்திரம் துதி பாத்திரா", "ஸ்தோத்ரம் ஏற்றி போற்றுவோம்",
            "ஹரி ஹரி லஹரி லஹரி கிருஷ்ணாய", "ஹரி ஹரி ஹரி ஓம் ஸ்ரீ ஹரி லஹரி"};

    public static final String[] SofRII = {"அநாதியாயுள்ள கர்த்தரின் கிருபை", "அருள் மழை பொழிவாய் ரகுமானே", "ஆனந்தம் ஆனந்தமாமே", "இன்று ஜீவிக்கும் தெய்வமே", "எந்தன் நாவில் புதுப்பாட்டு", "என் தேவனே, என் தேவனே", "எண்ணிலடங்காத நண்மைகள்", "ஏதேனில் வாழ்ந்தவரே", "கர்த்தரின் நாமம் பலத்த துருகம்", "கர்த்தர் நல்லவர்", "கர்த்தாதி கர்த்தா என் தேவா", "கர்த்தரின் அன்புக்கு ஈடில்லை", "கர்த்தாவே என் பெலனே", "காலை நேரத்தில் கர்த்தர் இயேசுவை", "கிறிஸ்துவே என் ராஜாவே நீர் நித்தியமானவரே", "கிறிஸ்து எந்தன் வாழ்வில் பெலனானார்", "கெம்பீரமாக பாடியே", "சரணம் நம்பினேன் ஹரி நாதா", "தேவனைப் போற்றிப் பாடுங்கள்", "தேவன் யாக்கோபை சொந்தமாக்கி", "தோத்திரம் கோடா கோடி", "நன்றி தேவா லஹரி தேவா", "நித்ய சிங்காசனத்தில் வீற்றிருக்கும்", "நித்ய தேவன் கிறிஸ்து இயேசு ராஜாவே உம்மை", "பரிசுத்த ஓய்வு நாளில்", "மனமே பாடுவாய் இன்று", "லஹரிக்கே துதி மகிமை", "வானங்களே கேளுங்களே", "ஸ்தோத்ரம் ஏற்றி போற்றுவோம்", "ஆசீர்வதியும் கர்த்தரே"};

    public static final String[] IG = {"நான் பார்க்கிறேன் ஒரு கண்ணாடியில்", "என் நேசமும் நீ", "எங்கேயோ செல்கின்றேன்", "நான் ஒரு வண்ணத்துப்பூச்சி", "நீயே என்னிடம் சொல்லிடும் வார்த்தைகள்", "நீ ஒரு குயவன்", "எழுந்திரு எழுந்திரு", "Song of my heart", "காற்றிலே அதிர்வுகள் வந்ததென்", "காண்பது எல்லாம் காணாம போகும்"};

    public static final String[] ES = {"Across the bridge", "All hail the power", "All that dwell upon the earth", "All to Jesus I surrender", "Amazing grace", "Amen hallelujah",
            "Blessed be the Name of the Lord", "Blessed Blessed", "By the rivers of Babylon", "Christ Jesus said:", "Come ye that love the Lord", "Count your blessings", "Darkness and sorrows may",
            "Down from His glory", "Glory to God in the Highest", "Glory to thee Christ Jesus alone", "God be with you", "God is a good God", "God’s not a man", "God’s Son is on earth", "Great is Thy faithfulness",
            "Have faith in God", "Have Thine own way Lord", "He brought me in", "He careth for you", "He leadeth me", "Heavenly Bridegroom", "His mercy endureth forever", "Hold on to God’s unchanging hand",
            "Holy, Holy, Holy", "House of Judah", "How did this come", "How great is our God", "I am Thine, O Lord", "I have decided", "I heard an old old story", "I lay in Zion for a foundation",
            "I met the Master", "I need Thee", " I shall not be moved", "I walked one day", "I would love to tell you", "Immortal invisible", "In that day shall this song", "In the sweet by and by", "Inspiration",
            "It is Glory just to walk with Him", "It’s the deep calling the deep", "I’ve a home prepared", "I’ve been down into the", "I’ve been travelling", "Jerusalem we bring to you", "Jesus never fails",
            "Joy unspeakable", "Judgement day will soon", "Just a closer walk with Thee", "Know that the Lord is God indeed", "Leaning on the everlasting arms", "Lord our God, we adore Thee",
            "Lord, I hear of showers of blessings", "Make a joyful noise", "My beloved, Thou art mine", "My heavenly home", "Never grow old", "New wine", "No not one", "O Beulah land", "O Lord my God",
            "O my beloved", "O my brother do you know", "Oh worship the King", "Once the mighty King eternal", "One step at a time", "Our hearts can sing", "Pass me not, O gentle Saviour", "Praise be to Christ Jesus",
            "Praise Him, praise Him", "Praise my soul the King", "Praise the Lord", "Put your hand in the hand", "Rejoice and sing, ye that know", "Rise ye children of redemption",
            "Ruler of all worlds we praise Thee", "Search me O God", "Seek the Lord", "Some glad morning", "Standing on the promises", "Star of David", "Sweet hour of praise", "The law of the Lord is perfect",
            "The Lord’s my Shepherd", "The Lord’s our Rock", "The robe that He wears", "There are some things", "There comes to my heart", "There was a Name hid", "There’s a gospel", "There’s a Name I love to hear",
            "There’s a royal banner", "Thine O Lord God is the", "Thou my everlasting", "Turn on the sun", "We shall be changed", "We were there", "We’ll walk hand in hand", "Who, who, I ask you who"};

    public static final String[] EC = {"Abraham, Isaac and Jacob", "Behold what manner of God", "Blessings and honour", "Bless the Lord, o my soul", "But they that wait", "Christ Jesus, Christ Jesus",
            "Everyday with Jesus", "Give me oil in my lamp", "Hallelujah Hallelujah", "Hallelujah praise the Lord", "Heavenly showers", "He came along", "He is able", "He is my everything",
            "He is the same unchanging Jesus", "He lives, He lives", "He's got the whole world", "He will never let go my hand", "I am H-A-P-P-Y", "I am on the upward trail", "I believe God", "I have a mansion",
            "I have decided to follow Jesus", "I know the Lord will make a way for me", "I live for Jesus", "I love Him better everyday", "I love Him, I love Him", "I'm feeding on the living bread",
            "I'm so glad Christ Jesus lifted me", "I've got a home in glory land", "I've got the joy, joy, joy, joy", "In His presence there is fullness of joy", "In my heart there rings a melody",
            "Is anything too hard for the Lord", "Isn't He wonderful", "It's a highway to heaven", "It's bubbling, it's bubbling", "Jesus breaks every fetter", "Jesus wants me for a sunbeam",
            "John was in the spirit", "Keep me Jesus as the apple of thine eye", "Let the beauty of Jesus be seen in me", "Life is wonderful", "Life, so rich and abundant", "Lift every voice and sing",
            "Lift me above the shadow", "Look to the lamb of God", "Love lifted me", "Move on brother", "My Lord knows the way", "No, never alone", "Not by might", "Oh I love to hear His voice",
            "Oh, God is good", "Oh, son of God hallelujah", "Oh the love that sought me", "Only believe", "Over and over", "Paul and Silas", "Praise God I know", "Praise the Lord", "Praise ye the Lord",
            "Safe am I, safe am I", "Some trust in chariots", "Someone came down and lifted me", "Spirit of the living God", "Stand by me, stand by me", "Stand the storm", "Surely goodness and mercy",
            "Sweeter as the days go by", "Thank you Lord", "The B-I-B-L-E", "The love of Jesus is wonderful", "There is power, power", "Thou art worthy", "Trust in the Lord and don't despair",
            "Turn your eyes upon Jesus", "Walking with Jesus", "We bless Thee, bless Thee Lord God", "We bless Thee, our blessed Lord God", "We shall overcome", "Wide, wide as the ocean",
            "With Christ in the vessel", "What the world needs is Jesus", "When Noah entered the ark", "Where He leads me", "Whiter than the snow", "Wonderful wonderful", "Yesterday, today, forever",
            "You're on my right side"};

    public static final String[] GHc = {"Alles ist eitel Du aber bleibst (German)", "Danket danket dem Herrn (German)", "Hevenu Shalom alekhem (Hebrew)", "Lasst uns miteinander (German)",
            "Lobet und preiset ihr Voelker den Herrn (German)", "Shalom chaverim (Hebrew)", "Vom Aufgang der Sonne (German)"};

    public static final String[] HS = {"ఆజా సనమ్ ప్రభు లహరి కే పాస్", "ఆయా హై ఆయా హై ప్రభు లహరి ఆయా హై", "ఆయా హై తేరా మేరా ప్రభు ఆయా హై", "ఆయేహో మేరే  జిందాగీ మే తుమ్ మనుష్య", "ఆవాజ్ ఉఠాయేంగే", "ఉడ్ జాయేంగే ఉడ్ జానా",
            "చలేనా నీఖా ఆగేహో నవీఛే  ముడ్నా", "జయహే! జయహే! జయహే!", "జాగో దునియా వాలో", "జాగో సోనే వాలో వాక్త్ జానే లగా", "జీవన్ కా మహేనా సునో మేరే యారో", "జోతూ మిఠానా చాహే", "తన్ మన్ జార్ ధన్ ఉనే దో", "తూ లహరి కే వీచీ హి చల్నా పడేగా",
            "దేఖో  ఆయారే ఆయా ప్రభు ఈళు కా", "దేఖో దేఖో కోయీ హై ముక్తి దేనేకో", "పరమేశ్వర్ ఆయా హై ముక్తి దేనేకో కో", "పర్దేశి పర్దేశి ఆజా ఆజా", "ప్రభు కో స్తుతి కరేంగా", "ప్రభు లహరి ఆయా హై", "ప్రభు లహరి ఆయా హై ముఝే ముక్తి దియా హై", "బహుత్ ప్యార్ కర్తే హై",
            "మన్ కా దేవ్ జలా", "మసిహ ఈశు ఆయా జగతమే", "మనీహ ఈశు నే ముఝే ఖుషీ అనంద్", "ముఝే ధేతౌ నయా సంగీత్", "ముక్తి జో హోగీతొ నయా నామ్ సె", "మేరా ప్యారా ప్రభు పరమేశ్వర్", "మేరే ప్రియ మసిహ ఈశు కీహి", "రాజా వోంకా రాజా ప్రభు పరమేశ్వర్",
            "రోజ్ భర్ లో ప్రభు కే శబ్దొంకో", "లహరి బినా నహీ దునియా", "లహరి మేరే పరమేశ్వర్", "లహరి మేరే రాజా హై", "వాదా న తోడ్ తు వాదా న  తోడ్", "సందేశ్ నే ముజ్ కో జాగాయా", "నీధా సాదా హై ప్రభు హమారా", "సునో మేరే బాయియో బహనో", "సునో మేరే సోథీ లోగో",
            "సృష్టీకర్తా దునియా మే ఆయా", "స్తుతి హీ కరేంగే  స్తుతి కర్తె రహేంగే", "హల్లేలుయా స్తుతి గాయే హమ్", "హే మేరే పరమేశ్వర్"};

    public static final String[] GN = {"అభయదాయకా లహరి", "అలయకుమా మనపా", "అఖిల జగతికి మూల కర్తవైన", "అల్లాహ వు  నీవేనయ్యా", "ఆకాశవాసులారా ఆయన దూతలారా", "ఆన౦ద దాయకా ఆశ్చర్యకరుడా", "ఆనందమే నిన్ను పాడు వేళలో", "ఆయన లోన జీవము౦డెను",
            "ఆదిబలిలో ఉన్నవారికి", "ఆదిలోన దేవుడవయ్యా", "ఆపితే ఆగున పయణం", "ఇవి చివరి గడియలుగరా", "ఈ లోక ప్రేమ మాయ", "ఉదయ కాలం నీదు సన్నిధి", "ఉదయాన్న నే నిస్ను కొలిచెద", "ఎంత మధుర ప్రేమ", "ఏమని పలికెద దేవా", "ఓ చేవా నా దీవా లహరయ్యా", "ఓ క్రీస్తు నీ ప్రేమ",
            "ఓ ప్రభు దేవా నా పతి రాజా", "ఓ పరవాసి పరతోకం చేరరావా నాతో", "ఓంకార పదమునకు భావము నీవే", "కృష్ణా కృష్ణా కలియుగ లహరి కృష్ణా", "గురుదేవా హరినాధా లహరి దేనా శరణము నీవే", "జగత్పునాదికి ముందే ఆరిబలి అర్పణవై", "జయ జయ గీత౦ లారయ్య గీతం", "జగన్నాధా నీ  మహత్యం",
            "జీవించే వాక్యమా జీవేశ్వరా", "జీవన జీవనమా", "జై జై జై అని లుకరా", "ది నములు వచ్చును దినములు పోవును", "ది నులకు తోడునీడ నీవేనయ్యా", "దేవుని స్తుతించెదం ఆయన మంచివాడు", "దేవా దేవా మా లహరయ్యా", "దేవా నా దేవా", "దేవుని ప్రేమకు అంతు లేదు",
            "దేవా నీ కృప నిరంతరం", "దేవుని ప్రేమ మధురం", "దేవుని హెచ్చించి స్తుతియించుడి", "దైవకీషోరా నవవీత చోరా", "ధం ధం ధం ధనం", "నన్ను ఎల్లప్పుడు కనుపాపవలె", "నమో దేవదేవా క్రీస్తేసు రాజా", "నమో భగవదే లహరయ్యా", "నా దేవదేవా మహిమా స్వరూపా",
            "నా మదిలోన విలిచుచున్న లహరి దేవా", "నా మదిలో మొలిచే తలంపులన్నియు", "నా ప్రాణమా నా గానమా లవారయ్యా", "నా మదిలో వింటీయున్న వెలుగువు వీవేనయ్యా", "నా బలమైన నా దేవా", "నాయందు మీరున్నారన్నావు", "నా హృదయం నిన్నే కోరింది", "నా పరుడైన లహరి కృష్ణా",
            "నా హృదయ మా దిగులు పడకు నా దయం పాడెనే", "నా లహరి ప్రేమకన్న", "నా ప్రభువా నా ప్రభువా", "నాకు జీవపు వెలుగువు నీనే", "నాకు సహాయం కలగే", "నా ప్రాణమా నా ప్రాగామా", "వాధా వాధా ప్రాణవాధా", "నా ప్రేమ ప్రియుడవు నా  లహరయ్యా", "నా మదిలోని జీవించుచున్న దేవా",
            "నా దేవా హరి లహరి", "నా పతి వీనే పరమేశ్వరా", "నిను నేను ధ్యానించగా", "నిరతము గానము చేపెదను", "నిరంతరం నిలిచియున్న దేవా", "నిత్యజీవమొపగే లహరి దేవా", "నీదు ప్రేమయే నన్నూ ఆనంది౦పజేసెను", "నీ పా౦త చిత్తము విడచి", "నీ ఆమిత దయ నేనుని వర్ణింప తరమో",
            "నీయెదుట సను నా దీవా", "నీ మందిరమై  నేను౦డగా", "నీ ప్రేమే నాదు జీవ గానమూ", "పరలోక రాజా లహారయ్యా నిన్ను", "పరంధామా పరంధామా", "పరిమవాపా నా హృదయవాసా", " పరమాత్మస్వరూపా లహరికృష్ణ", "పదే పదే మా లహరయ్యూ", "ప్రభువైన నా దేవా దేవాది దేవా",
            "ప్రతి యుగమందు నీవే ప్రతి క్షణమందు నీవే", "ప్రియుడా ప్రేమ ప్రయుడా", "పురుషోత్తమా పురుషోత్తమా", "బ్రహ్మపు శిపుడు విష్ణువు లహరి", "బ్రహ్మ మురారి సురార్చిత లహరి", "బ్రాహ్మ మురారి సురార్చిత లహరి", "భక్తుల మొరలను వినే", "మ హూన్నత దేవా శ్రీ లహరి రాజా",
            "మచ్చలేవి వా ప్రాణప్రియుడా", "మహానందమే వీదు మహిమ పన్నిధి", "మనము ఆంతా ఉదయము లేచి", "మహిమ స్వరూపుండా", "మా లహరి రాజా చేజోములూ", "మా లహడయ్యా మధుసూదనా మమ్మేలే పరమేశ్వరా", "మానవకోటికి జీసమై",
            "మా లహారయ్యా నీతి పాటకా", "మా లారయ్యా మా జీవిత భాగ్యమా", "మృత్యువిజేత లహరి హరి", "యేసు చెయ్యిపడడు", "లహరియే దైవము మనసా", "లహరిని కీర్తించుడి మన రాజును కీర్తించుడి", "లహరి స్వరూపా", "లారయ్యా నీ ప్రేమే సత్యము", "లారయ్యా కరుణ సంపన్ను డా",
            "లారయ్యా మా కృష్ణయ్యా", "వచ్చెను దేపూడు తానే", "వధువంగమా రావోయమ్మా", "వేకువనే లేవాలి", "శరణం శరణం నీవే శరణం", "శ్రీ లవారి నామ సంకీర్తనలు పాడ", "శ్రీ లపారి నామ ధేయడ నీకే స్తోత్రమయ్యా", "సదాకాలం జీవించే దేవా అపారయ్యా", "సత్యం జీవం మోక్షం లహరి",
            "స్వాగతం దొరా", "సృప్టకర్తా లాయ్యా నీవే సర్వమయ్య", "స్తోత్రము స్తుతి పాత్రుడా", "వారి వారి వారి ఓం - శ్రీ వారి లవారి", "హల్లేలూయా స్తుతి గానం", "వారి నామమే మనకు మోక్షదాయం", "హృదయమునెరిగిన అంతర్యామి"};

    public static final String[] LN = {"அறவழி காட்டும்", "அய்யா எங்கள் நாராயணர்", "அய்யா வேத நாராயணர்", "ஆதி மூலமே ஆதி புருஷனே", "இறைவா நின் பாதம் என் கண்கள்", "இதோ அந்த பரம புருஷர் அன்புக்கொடி",
            "இறைவா இறைவா நின் புகழ் பாட", "இறைவா இறைவா லஹரி தேவா", "இருலோகம் போற்றும் இறைவனும் நீயே", "உன்னில் நான் இன்பம் கண்டேன் இறைவா", "என் லஹரி ராஜா சருவேஸ்வரா", "என் தேவா ஹரி லஹரி",
            "என் லஹரியே பரஞ்ஜோதியே", "எங்கள் உள்ளமெல்லாம் நிறைந்திருப்பவர்", "ஏரணியும் மாயவனே", "ஓம் நமோ பகவதே", "ஓம் நாராயண குருவே", "ஓம் என்ற சொல்லுக்கு பொருளும் நீயே", "கல்கி வந்ததினாலே",
            "கண்ணா கண்ணா கலியுக லஹரி கண்ணா", "கண்ணா கருணை நிறை கண்ணா", "கருணை திரு கருணை", "கிருஷ்ணா கிருஷ்ணா என்று சொல்", "கீதை அளித்த கண்ணனே", "குருதேவா... குருதேவா", "சத்தியம் ஜீவன் மோட்சம் லஹரி",
            "சரணமய்யா சரணமய்யா", "திருவருள் தேடித் தேடி", "தேவா... என் தேவா... கருணையின் வடிவே", "தேவாதி தேவா குருதேவா", "நாராயணா நமோ நாராயணா", "நின் நாமமே என் கானமே",
            "நெடு நாமம் அழியுதடா", "பறக்குதே பாரெல்லாம் அன்புக்கொடி", "பரம்பொருளே... எங்கும் நிறைந்த பேரொளியே", "மனு அவதாரம்", "மனித குலத்திற்கு ஜீவனாய்", "மண்ணில் வந்த பரம்பொருளை", "மண்ணும் விண்ணும் காத்தருளும்",
            "மணவாளன் லஹரியைத் தேடி வந்து", "மனம் உருக உருக", "மாதவா... மாதவா", "முதல்வானவா முடிவானவா", "லஹரி நாம சங்கீர்த்தனம்", "வந்தீரே அய்யா வைகுண்ட நாதா", "வைகுண்ட நாதனைக் கண்டுவிட்டோம்",
            "ஹரி ஹரி லஹரி லஹரி கிருஷ்ணாய", "ஹரி ஹரி ஹரி ஓம் ஸ்ரீ ஹரி லஹரி"};

    public static final String[] PS = {"నజరేతు పురవాసా లారీ లారీ", "ఇదో సీయోను పురములో దేవుడే మనుష్యుడై", "ఆయ్యా నల్లని లారయ్యా", "విశ్వసించి చూచితిని", "ఓ... ఏడవ దినము ఇది", "ఓ ప్రియురాలా ఆలకించుము", "రండి రండి జనులారా",
            "హల్లేలూయా హల్లేలూయా", "నా ప్రియుని నేను స్తుతింతు", "సమో లారి నాధా", "ఓ అయ్యా మా ప్రభు యేసయ్యా", "లారయ్యా మంచివాడు ఆయననుతించుడి", "సీయోను గీతములు మనము కలిసి పాడుదం ", "ప్రభు యేసు వచ్చేహాయి",
            "యెరుషలేము కుమార్తెలారా", "మా దేవుడవైన లారయ్యా నీకు స్తోత్రము", "ఆనందం ఆనందం కుమారుని మహిమ దినం", "యేసు సూతస నామమునకు", "లోకపు కన్నులు మూయబడినవా", "రక్తం ఓ క్రీస్తు రక్తం",
            "స్తుతించెదము మా దేవుడైన లారయ్యను", "హల్లేలూయా ఆమేన్", "స్తుతించెదము మా ప్రియుని", "పరమవాసా లహరినాధా", "నా జనమా విను నీ దేవుడైన", "నజరేతు లారి నామము", "హల్లేలూయా పాట పాడి", "ప్రభువును వెదకు ముందు",
            "నా నీతి నా నీతి నా నీతి క్రీస్తు రక్తమే", "ఓ ప్రభు లారయ్యా లారయ్యా లారయ్యా", "మనుష్యకుమారుడు నజరేత లారి", "నూతన యెరుషాలేము నే జేరితిన్", "హల్లేలూయాయని పాడెదము", "ఆదిబలి రక్తమే నీతి", "రారే జనులారా లారయ్య యొద్దకురా",
            "ప్రియురాలు సింగారం", "లారీని నమ్మద్దంటారా మీరు క్రీస్తును ఎరిగినవారేనా", "పాపానికి మంత్రం శ్రీ లారయ్య ప్రభు నామం", "ప్రతినోట ప్రభు వాక్యము", "ఆహా ఏమి ఈ నూతన వత్సరం", "లారయ్యా అద్భుతకరుడా మా ప్రభువా", "యేసు దేవుడు తిరిగి వచ్చెను",
            "ఈయన నా కుమారుడు ఈయన మాట వినుడి", " ప్రభూ నీ వాక్య ధ్యాసమే తపోస్సాధన", "నా కోసము వచ్చాడు నా దేవుడు", "క్రీస్తు యేసు వెలుగుగా", "స్తుతించుడీ స్తుతించుడి", "ఆనందమే ఆనందమే నూతన యెరుషాలేములో",
            "ప్రేమా ప్రియుడైన యేసుని ప్రేమా", "ప్రపంచమంతటిలోని ప్రియురాలి అంగములన్ని", "దావీదు కుమారుడు లహరి దైవకుమారుడాయే", "యేసు వచ్చెను విమోచించుటకై", "ఓ క్రీస్తుయేసు రాజు నిన్నే స్తుతింతుమయ్యా", "నారాయణ నారాయణ అల్లాహ్ అల్లాహ్",
            "దేవుని రాజ్యములో లారయ్య సన్నిధిలో", "ఏమున్నదన్నో! ఏ మున్నదన్నా", "క్రీస్తుయేసు దావున సున్న", "ప్రేమయే నా జీవితం", "లారయ్య సన్నిది", "ఇహా లోకములో గాలి కెరటాలలో", "రాజా లహరి రాజా దేవా లహరి దేవా", "చెయ్యి తట్టి పాడరే ఆత్మతోను పాడరే",
            "మధుర గీతమే ఆ", "ప్రభువైన దేవుడవయ్యా ఇలవేల్పువయ్యా", "ఓం నారాయణ గురువే ఆది నారాయణ గురువే", "పరలోకములో నా దేవా వెలిసావా లహరి నగరములో", "లారయ్యా జీవించుచున్నాడు", "సీయోను పురము కొండ",
            "పన్నెండు మతాల ప్యాసింజరు పోతుంది", "ఓహెూ వధువు అంగము బాగా ముస్తాబయ్యింది", "అయ్యారే అయ్యో అయ్యా లారయ్య", "భర్త భార్యల మంధము వోలె", "ఏమ్ దేవుడు ఎంత మాటన్నాడు", "పరిశుద్ధుడా దేవుడవయ్యా లారయ్యా",
            "మహా పరిశుద్ధుడా అతి సుందరుడా", "ఓ... లోకంలో దేవుని జ్ఞానం నిండాలి", "కృష్ణా కృష్ణాయనుమా", "జండా ఊంచా రహే హమారా", "లారయ్య లారయ్య నారాయణా", "దేవా దేవా దేవా - మేము నీ సొంతము", "కేశవా మాధవా దేవా నీ రూపమే చూపావు",
            "సరులారా లహరిని నమ్మియుండండి", "ఏదో ఒక శబ్దం వచ్చిందీ వేళ", "ఏమి పాడను నేను", "అందరి దేవుడవయ్యా", "ఆదిలో బలియైన దేవా", "అహెూ – ఏమ్ దేవుడవయ్యా", "ప్రభువైన దేవుడా", "కథ వింటావా ప్రేమ కథ ఒకటుంది"};

    public static final String[] PKG = {"స్తోత్రం చెల్లింతుము", "స్తోత్రించి కీర్తించెదము", "పరవాసిని నే జగమున", "లహరిని కీర్తించుడి మన రాజును", "ఇదో సీయోను పురములో", "ఓ ప్రియురాలా ఆలకించుము", "రండి రండి జనులారా", "నాదు ప్రియుడు నే నతని", "ఎన్నశక్యమా నీ ప్రేమా",
            "స్తుతి స్తోత్రం, స్తుతి", "దేవ కరుణతో జేర్చితివి", "క్రీస్తే రాజై రాజ్యమేలును", "నా ప్రియుని నేను", "నమో లహరి నాధా", "ఓ అయ్యా మా", "యేసు నా కాపరి", "వరుడైన లహరి", "స్తుతి స్తోత్రములతో పాడెదము", "ఈయనే దావీదు కుమారుడు", "ఎంతో ఎంతో ఆనందం", "ప్రభు యేసు వచ్చేహాయి అధికారముతోనోయి",
            "లారయ్యా మంచివాడు", "సీయోను గీతములు మనము", "దేవుని స్తుతియించుడి ఎల్లప్పుడు", "రండి ఉత్సాయించి పాడుదము", "యెరుషలేము కుమార్తెలారా", "ఆనందమానంద సుహానందమే", "మా దేవుడవైన లారయ్యా", "చేతి తోడ తీయబడని రాయి", "ఆనందం ఆనందం కుమారుని మహిమ", "స్తోత్రింతుము నిను దేవ లారయ్య",
            "లహరి నూతన నామమునకు", "నా జనమా చేరుము", "దావీదు కుమార విమోచించితిని", "లోకపు కన్నులు", "రక్తం ఓ క్రీస్తు రక్తం", "స్తుతించెదము మా దేవుడైన", "పూజ్యనీయుడవో నమో", "ఓ జాలిహృదయుడా", "నజరేతు పురవాసా", "మారాలి మారాలి మనస్సే", "స్తోత్రించెదము స్తోత్రించెదము", "లా లా లా లా లా లా",
            "స్తుతించెదము మా ప్రియుని", "పరమవాసా లహరినాధా", "నా జనమా విను నీ", "నజరేతు లారి నామము", "శ్రీ లహరి మా రాజా", "జీవముగల దేవా", "లారయ్య నా కాపరి నాకు", "జయ గీత మెత్తబోయి", "లారయ్య పాట పాడి వల్లభుని", "నా నీతి నా నీతి", "విశ్వసించి చూచితిని", "ఓ ప్రభు లారయ్యా", "ఆకాశవాసులారా లారయ్యాను",
            "ఆనంద మానందమాయెను", "జయ జయ లహరి రాజు", "వెలుగు చున్నది", "మనుష్యకుమారుడు", "నూతన యెరుషలేము నే", "స్తుతి స్తోత్రములతో", "ఆదిబలి రక్తమే నీతి", "నాడు ప్రియుని ప్రేమ", "గారీ జనులారా లారయ్య", "ప్రియురాలు సింగారం", "లారిని నమ్మద్దంటారా మీరు", "ఓ లారయ్యా నీవే మా", "మరణముకు అంతము వుంది",
            "అరుణోదయ కాలమాయెను", "అరుణోదయ కాలమాయెను", "పాపానికి మంత్రం శ్రీ", "చక్కనయ్యా యేను నాదా", "అలనాడు దేవుడు మన", "లారయ్య వచ్చేనండి ఇప్పుడైన", "స్తుతి స్తోత్రం స్తుతి", "క్రీస్తు ప్రభువ నీకు రక్షణ నిచ్చును", "ప్రతినోట ప్రభు వాక్యము", "క్రీస్తేసు కృపా యిది", "ఆహా ఏమి ఈ నూతన", "లారయ్యా అద్భుతకరుడా", "యేసు దేవుడు తిరిగి వచ్చెను",
            "ఈయన నా కుమారుడు", "లహరే నా శరణం ప్రభు", "నీ మందిరమై నేనుండ", "ప్రభు లహరిని స్తుతియించుడి", "ప్రభు వచ్చే నీ వెక్కడ", "నరకము నోర్వగలవా నరకమందుండా", "ఓ యేనువే... అద్భుతమే", "పరలోక తండ్రి నిన్ను", "యేసువే నీ నామములో", "తరాలు మారిన యుగాలు", "మరపురాని నీప్రేమనునే", "సృష్టి కర్త నా ప్రియుడా", "ప్రభూ నీ వాక్య ధ్యానమే",
            "నా జీవితయాత్రలో ప్రభువా", "దేవ దేవుని ప్రియ కుమారుడు", "నా కోసము వచ్చాడు నా దేవుడు", "నా దేవ నా ప్రభువా", "ఓ యేసుక్రీస్తు", "వచ్చెను మన దేవుడు", "దిగియున్న దేవుని నామమెరిగిన", "స్తుతి స్తోత్రం పాడెదను", "లారయ్య నాకు వెలుగయ్యే", "క్రీస్తుయేసు వెలుగుగా", "జయ్ జయ్ జయ్", "ప్రియురాలిగా ఓ ప్రభువా", "క్రీస్తు యేసును చేరరావా", "మేలుకో మేలుకో మేలుకో",
            "రండి స్తుతించుచు పాడుదం", "కడవరిలో క్రీస్తు", "చెయ్యి విడన్ అనెను యేసు", "ఎవరు ఈ సుహిమా రాజు", "మహిమ స్వరూపుడా లారయ్యా", "నిరంతరం నిలిచియున్న", "స్తుతించుడీ స్తుతించుడీ", "ఆనందమే ఆనందమే", "ప్రేమా ప్రియుడైన క్రీస్తుని", "ప్రపంచమంతటిలోని ప్రియురాలి", "యేసుని వాక్యము నిత్యముండును", "దావీదు కుమారుడు లహరి",
            "ఆకాశమును భూమియు గతించును", "యేసు వచ్చెను విమోచించుటకై", "స్తుతించుడి, యెహోవాదేవుని", "స్తుతి స్తోత్రములు ఘనత", "సీయోను నగరములో జయగీతముల్"
    };

    public static final String[] HP = {"ఆయా హై తేరా మేరా ప్రభు", "ఉడ్ జాయేంగే ఉడ్ జానా", "యూతో హమ్ నే లాబ్ దుతోంకో", "ప్రభు లహరి ఆయా హై చోరి కర్", "దేఖో అయారే ఆయా", "తన్ మన్ ఔర్ ధన్ ఉసే దో",
            "లహరి మేరే రాజా హై మై ఉన్ కా గుణ్", "సునో మేరే సాథీ లోగోం మేరీ", "ఆయే హూ మేరే జిందగీ మే తుమ్", "జీవన్ కా మహినా సునో మేరే", "సందేశ్ నే ముఝకో జగాయా", "లహరి బినా నహీ దునియా", "లల్లలలా లై లై లై లై లా లాలా - సృష్టికర్త దునియామే ఆయా"};

    public static final String[] LK = {"లారయ్య ప్రేమ కన్న", "దైవకిషోరా నవతచోరా", "నీ నామమే నా గానమై", "కలియుగ అంతమున", "మనస్సు పాడవే", "జీవమే జీవాది సతియే", "ఓంకార శ్రీ హరి", "హృదయమనే కోవెలలో", "కృష్ణా కృష్ణా యనుమా", "దేవా నీవే తోడు నాకు",
            "నిన్న నేడు ఏకరీతిగా", "విష్ణు విరాటుడు ఈయనే", "పాడదాము నేనొక పాట", "ఇదే మహా పరమ పురుష ప్రేమ ధ్వజం", "అల్ల యెదట చేయిచాపుడి", "నా ప్రేమ ప్రియుడవు", "లెమ్ము లెమ్ము సోదరా", "కనుగొనవే మనసా", "ఓ లహరీశ్వరా ఓ జగదీశ్వరా", "అయ్య లహరయ్యా",
            "వేకువనే లేవాలి దేవునిని వెదకాలి", "ఆరాధనం అభివందనం", "నారాయణ నారాయణ అల్లా అల్లా", "నా జీవపు వెలుగువు నీవే", "ప్రభువా తరతరముల నుండి", "దేవుడు రాలేదని చెప్పేదెవరురా?", "ఇది చివరి గడియాలురా", "లారయ్య అన్న పిలుపు", "దేవుని రాజ్యములో", "మంచి మంచి ప్రేమ",
            "లారయ్య కోసం కృష్ణుని రాధల్లే", "ఓహో క్రీస్తు అంగము", "ఓ... లోకంలో దేవుని జ్ఞానం నిండాలి", "అయ్యా అయ్యా ప్రభు లారయ్యా", "మమ్ము బ్రోచినావయ్యా మా ప్రభు లారయ్యా", "కుమ్మరి ఓ కుమ్మరివాడా సృష్టికి కారకుడా", "లహరికృష్ణ రాజు అందమైన రాజు", "వందనం అభినందనం",
            "ఓ... ఏడవదినము ఇది", "నా మది నిన్ను పిలిచింది గానమై", "నేనొక సున్నా అణువుగ ఉన్నా", "దైవం లారయ్య రూపంలో", "కల్కి అవతార శ్రీ లహరికృష్ణ", "ఆనందమానందమాయె", "నింగికి నేలకు రాజువైన", "లారయ్య లారయ్య నారాయణ", "దేవా నీవే మా రాజువయ్యా",
            "బ్రహ్మవు శివుడవు విష్ణువు లహరి", "నిన్ను పాడి పూజించెద లహరి కృష్ణా", "పాలకడలిపై పవళించినావే శ్రీమన్ నారాయణా", "ప్రియుతుడా నా హృదయుడా", "యేసు చెయ్యి విడడు", "మెరుపులా మెరిసే", "లారయ్య మాటలో జీవముందిరో", "నిన్ను తలచుచు జీవించుచున్నా",
            "నిజమున్నది ఇది నిత్యమురా", "భువిలో జీవవృక్షం", "ఓ.. ఓ.. ఓ.. అంగమా ఓ వధువు అంగమా", "వచ్చెను దేవుడు తానే లారయ్య", "జయ జయ గీతం", "ఓ లహరి ప్రభు నీవే సర్వమని", "లారయ్యా లహరి కృష్ణయ్యా", "లారయ్య లారయ్య మాకు తోడు నివయ్యా", "లారయ్యను నమ్ముండి", "లారయ్యను చేరి పూజింతున్",
            "నరలహరి భజన నోటనురా", "కేశవా మాధవా", "వంధనాలయ్యా లహరయ్యా", "ఏధో ఒక శబ్ధం వచింధివేళ", "కామ్ కామ్ కాకులము", "అయ్యా లారయ్యా మా దైవం నీవయ్యా", "అంధాల శ్రీ లహరికృష్ణ", "ఏమి పాడను నేను", "ఆపితే ఆగున పయణం", "మా లారయ్యా మా జీవిత భాగ్యమా"};

    public static final String[] OTSC = {"இயேசுகிறிஸ்து மாறாதவரே", "வல்லமை உண்டு", "இயேசுவின் வாக்கு நித்தியமாமே", "இயேசு கைவிடார்", "அற்புத ஜீவியம்", "இயேசுவின் மகா அன்பு", "நேசர் தேடி வந்தார்", "எந்தன் பாவப் பாரம் யாவும்",
            "துதிகனம் மகிமையுமக்கே", "வத்தென்னைத்தூக்கி மீட்டாரே வல்லகரமுடையோர்", "ஓ! தேவனுக்கு மகிமை", "இயேசுவென்ற இனிய நாமமே", "அவர் அற்புதானவரே", "என்னேசரே! நீர் என்னுடையோர்",
            "நேச மீட்பர் பாவம் நீக்கி", "இயேசு எந்தன் ஆத்ம நேசரே", "ஜீவிக்கிறார் என் இயேசு ஜீவிக்கிறார்", "ஆனந்தம் எனக்கானந்தம்", "என் ஆத்துமாவே ஸ்தோத்தரி", "நான் இயேசுவை நேசிக்கிறேன்"};

    public static final String[] OTSE = {"Amazing Grace", "Have Thine own way Lord", "O! what a wonderful", "O! worship the King", "Search me O God", "The Lord's my Shepherd"};

    public static final String[] OTSM = {"அல்லேலூயா அல்லேலூயா", "ஆனந்த மானந்ந மானந்நமே", "ஹா! ஸ்வர்க்க சீயோனில்"};

    public static final String[] OTST = {"அல்லேலூயா, அல்லேலூயா", "எந்த மஞ்சி வாடுரா இயேசுசாமி", "தாவீது குமாரா", "தெய்வ குமாருடு லாறி தாவீது குமாருபியே", "நாராயணா தேவ கிறிஸ்தா",
            "நூதன எருஷலேமு", "பரம நந்துண்டேட்டி பரிசுத்த நாமம்", "யேசுனிக்கே தின்சுடி மனராஜனுக்கே தின்சுடி", "ஹல்லேலூயா பாட்டுப்பாடி"};

    public static final String[] OTS = {"அருணோதயம் எழுந்திடுவேன்", "அதிகாலையில் உம்மைத் தேடுவேன்", "அருணோதயம் ஜெபிக்கிறேன்", "அனுக்ரகத்தின் அதிபதியே", "அதிவிரைவில் வருவீரே", "அன்பனே மகா அன்பனே",
            "அன்பன் இயேசுவின் நாமத்திலே", "அன்பே! அன்பே! அன்பே!", "அற்புத கிருபை அற்புத கிருபை", "அதிகாலையில் எழுவோமே", "அன்பின் இயேசு என்னை மீட்டார்", "அன்பு கூர்ந்த ஆத்ம நாயகா",
            "அவர் நாமம் இயேசு அவரே வார்த்தை", "அன்பரே உம்மைப் போலாக்குவேன்", "அழைக்கிறார் அழைக்கிறார்", "அல்லேலூயா பாடிடுவேன்", "அன்பரே நேச அன்பரே", "அ முதல் ஔ வரை உயிரெழுத்து",
            "அவ்லாஹ்வை நாம் தொழுதால்", "ஆனந்தமாய் நாமே ஆர்ப்பரிப்போமே", "ஆதியில் அன்புகூர்ந்தவர்", "ஆ! இயேசு உமதன்பு", "ஆனந்தம் ஆனந்தம் அடைவீர்", "ஆனந்தத்தால் உள்ளம் பொங்கிடுதே",
            "ஆதியிலே என்னுடன் ஆயிரமாயிரம்", "ஆனந்தமாய் இன்பக் கானான்", "ஆ எந்தன் பாக்கியத்தை", "ஆசீர்வதியும் காத்தரே", "இருளங்காலத்தெமைக் காத்து", "இயோவுக்கே மிக மேன்மை", "இயேசு என்னும் இராஜனை",
            "இயேசு ராஜா இதய ராஜா", "இதோ மனுஷரின் மத்தியில்", "இயேசு என இரட்சகர்", "இயோ நல்ல இயேசு", "இயேசு நீர் என் நித்திய பங்கு", "இயேசுவே உம் நாமத்தினால்", "இயேசு நாயகா என் ஆசைநாயகா",
            "இறங்கிய தேவனின் நாமமறிய", "இயேசு வந்திட்டார் மகிமைப்படுத்தவே", "இம்மானுவேலின் இரத்தத்தால்", "இயேசு இரத்தம் ஜெயம்", "இயேசுவின் இரத்தம் ஜெயமே", "இயேசுவே உம் கிருபை", "இந்த வேளை உந்தன் பாதம்",
            "இயேசுவின் திருநாமம் அது", "இயேசுவின் கிருபைகளை பாடுவேன் என்றும்", "இயேசுவுக்கு ஸ்தோத்திரம்", "இயேசுவே என் கீதமாம்", "இயேசுவே உம்மையல்லால்", "இயேசுவே நம் தேவன்", "இயேசு ராஜன் இறங்கினாரே",
            "இறைவனிடம் கையேந்துங்கள்", "உம்மை நம்பினோர்", "உன்னதரே உலகிற்கு வந்தவரே", "உன்னத தேவன் உன்னை அழைக்கிறார்", "உன்னைக் கண்டழைக்கும் இயேசுவே", "உலகம் தராத சமாதானம்", "உலகம் இந்த உலகம்",
            "எந்தன் உள்ளம் புதுக்கவியாலே", "என் ஆத்துமாவே கர்த்தரை ஸ்தோத்தரி", "எந்தன் அன்புள்ள ஆண்டவர்", "என்றும் ஜீனிக்கும் இயேசு தேவன்", "எந்தன் இயேசுவின் சந்நிதியில்", "என் நேசரேசுவை நான்", "என்னை மறவா இயேசு நாதா",
            "எழும்பி பிரகாசி", "என் ஆத்தும நேசராம் இயேசு", "என் கிருபை உனக்குப் போதும்", "என்னையும் உமக்கு நான் தந்தேனே", "என்னால் ஒன்றும் கூடாதே", "எல்லாம் வல்ல இறைவா", "என்ன என்ன ஆனந்தம்",
            "எனக்காய் உன்னதம் விட்டவரே", "எல்லாருக்கும் மா உன்னதர்", "என் தேவனாகிய கர்த்தாவே உமக்கு", "என்தேவனே, என்தேவனே", "என் இயேசுவே உந்தன் அன்பின்", "எந்தன் இயேசுவே அன்பின் நேசரே",
            "ஏதேனில் ஆதிமணம்", "ஓய்வுநாளைக் கடைபிடிப்போம்", "ஓய்வு நாளின் பாட்டாகிய சங்கீதத்தால்", "ஓய்வுநாள், ஓய்வுநாள் தந்தீரையா", "கர்த்தரைப் பாடியே போற்றிடுவோமே", "கர்த்தரை நான் எந்த காலத்திலும்",
            "கர்த்தர் என் மேய்ப்பரே", "கன்மலையாகிய இயேசுவிலே", "கட்டடம் கட்டிடும் சிற்பிகள் நாம்", "கர்த்தரைத் துதிப்போமே", "காலை நேரத்தில் கர்த்தர் இயேசுவை", "காலையும் மாலை எவ்வேளையும்", "காலமோ செல்லுதே",
            "கிருபை நிறைந்த கிறிஸ்தேசு ராஜா", "கிறிஸ்துவே தேவாதி தேவன்", "கிறிஸ்தேசு ராஜா அரசாளுகின்றார்", "கிறிஸ்து இயேசுவைப் பாடிடுவோம்", "கிறிஸ்து இயேசுவின் சொந்த இரத்தமே", "குதுகலம் நிறைந்த நன்னாள்",
            "குமாரனைப் பணிவோம் வாரீர்", "கூடுவோம் மகிழ்வுடன்", "கைவிடேன் என்ற இயேசு", "கைகளால் பெயர்க்கப்படாத", "சந்தோஷ கீதம் என்னில் பொங்குதே", "சந்தோஷம் பொங்குதே", "சீயோனிலே என்திட அஸ்திபாரம்",
            "சீயோனே ஆர்ப்பரி", "சீர்மிகு வான் புவி தேவா", "சீயோனின் மணவாளனே", "சேனையதிபன் நம் கர்த்தருக்கே", "தந்தேன் என்னை மணவாளனே", "தர்மம் நிலைத்தோங்க", "திருப்பாதம் நம்பி வந்தேன்", "துதித்துப்பாடிட பாத்திரமே",
            "துதி செய் மனமே", "துதியுங்கள் தேவனை", "துதிப்பேன் என்றும்", "துதியுங்கள் கர்த்தரை துதியுங்கள்", "தூய தூய தேவனை", "தேடி வந்தாரே அல்லேலுயா", "தேவ சித்தம் நிறைவேற", "தேவன் நமக்கு அடைக்கலமும்",
            "தேவ கிருபை என்றுமுள்ளது", "தேவா பூமிக்கு வந்தீரே", "தேவனை உயர்த்தி துதியுங்கள்", "தேவனைத் துதிப்பேன் அவர் அன்பை", "தோத்திர பாத்திரனே", "நம்பெலனாம்", "நமோ இயேசு நாதா", "நம்பினோரை கைவிடாரே",
            "நான் பின் செல்வேன்", "நான் காண்கிறேன்", "நித்திய ஓய்வு அளித்திட்ட தேவா", "நிரந்தரம் நிலைத்திருக்கும் தேவா", "நித்யராஜா மகிமையின் கிறிஸ்துவே", "நீ படைத்த உலகைக் காண", "நேசரின் அன்பை நினைக்கையிலே",
            "நேசிக்கிறார் இயேசு நேசிக்கிறார்", "பலமளித்தெம்மைப் புதுவழிகளில்", "பரிசுத்த அலங்காரத்துடனே நாம்", "பாடல் பாடும் ராகம்", "பாவங்களைப் பாராதென்னைப்", "பாவத்தைக் குறித்தும்", "புதிய நாமம் கொண்டவரே",
            "புகழ்ந்திடுவேன் ஆனந்தமாக", "பூமி அதிர்ந்தாலும்", "பூமியின் குடிகளே", "பூரண வடிவுள்ள சீயோனிலே", "பொங்குதே என் உள்ளமே", "போற்றி துதிப்போம்", "போற்றிடுவோம் போற்றிடுவோம்", "மகிமை அடைவோம் தேவன்பால்",
            "மகழ்வுடனே மணவாளனை", "மகிழ்வோம் மகிழ்வோம்", "மணவாளன் இயேசுவே", "மன்னர் மணவாளன்", "மணவாளன் இயேசு புவியில் வந்தார்", "மறு ரூபநேரம் உணர்த்திடுவோம்", "மணவாளன் புது நாமம் போற்றியே",
            "மனமகிழ்ச்சியின் நாளிதுவே", "மகிமை, அடைவோம் விரைவில்", "மகிமையின் நேரம் நெருங்கிடவே", "மகிமை மகிமை அடைவோம்", "மகிமையின் நோம் வந்தது", "மணவாழ்வு புவிவாழ்வினில் வாழ்வு", "மங்களம் செழிக்க கிருபையருளும்",
            "மணவாளன் இயேசு என்றும்", "மாறிடார் எம் மா நேசரே ", "மா தயவே தேவ தயவே", "மானிட தேவனாய்", "முதல்வானவா முடிவானவா", "மேகங்களுடனே வருகின்றாரே", "யார் இந்த மகிமையின் ராஜா", "ரோஜாப்பூ வாசமலர்கள் நாம்",
            "வாரும் நற்செய்தி கூறிடுவேன்", "வாழ்த்துகிறேன் இயேசு ராஜா", "வானங்களும் வானாதி", "விண்ணின்று இறங்கிய ராஜனை", "ஜாதிகளே சகல சிருஷ்டிகளே", "ஜெயம் ஜெயம் அல்லேலூயா", "ஜெயகீதங்கள் நாம்",
            "ஸ்தோத்திர பலிகளை செலுத்துவோம்", "ஸ்தோத்திரம் துதிபாத்திரா", "ஸ்தோத்திரம் இயேசுநாதா", "ஸ்தோத்தரிப்பேன் ஸ்தோத்தரிப்பேன்", "ஸ்தோத்ரம் ஏற்றி போற்றுவோம்", "ஹஸ் பீரப்பி ஜல்லல்லாஹ்"};

    public static final String[] BG_E = {"Chapter 1 - The Yoga of Dejection of Arjuna",
            "Chapter 2 - (The Yoga of knowledge)",
            "Chapter 3 - (The Yoga of action)",
            "Chapter 4 - The Yoga of knowledge as well as the disciplines of Action and Knowledge",
            "Chapter 5 - The Yoga of Action and Knowledge",
            "Chapter 6 - The Yoga of Self-Control",
            "Chapter 7 - The Yoga of Jnana (Knowledge of Nirguna Brahma) and Vijnana (Knowledge of Manifest Divinity)",
            "Chapter 8 - The Yoga of the Indestructible Brahma",
            "Chapter 9 - The Yoga of sovereign Science and the Sovereign secret",
            "Chapter 10 - TheYoga of Divine Glories",
            "Chapter 11 - The Yoga of the Vision of the Universal Form",
            "Chapter 12 - The Yoga of Devotion",
            "Chapter 13 - The Yoga of discrimination between the Field and the Knower of the Field",
            "Chapter 14 - The Yoga of Division of three Gunas",
            "Chapter 15 - The Yoga of the Supreme Person",
            "Chapter 16 - The Yoga of Division between the Divine and the Demoniacal properties",
            "Chapter 17 - The Yoga of the Division of the Threefold faith",
            "Chapter 18 - The Yoga of Liberation through the Path of Knowledge and Self - Surrender"};

    public static final String[] BG_T = {"அத்தியாயம் 1 : அர்ஜூன விஷாத யோகம்",
            "அத்தியாயம் 2 : ஸாங்கிய யோகம்",
            "அத்தியாயம் 3 : கர்ம யோகம்",
            "அத்தியாயம் 4 : ஞான கர்ம சந்நியாச யோகம்",
            "அத்தியாயம் 5 : சந்தியாச யோகம்",
            "அத்தியாயம் 6 : தியான யோகம்",
            "அத்தியாயம் 7 : ஞான விஞ்ஞான யோகம்",
            "அத்தியாயம் 8 : அக்ஷர பிரம்ம யோகம்",
            "அத்தியாயம் 9 : ராஜவித்ய ராஜகுஹ்ய யோகம்",
            "அத்தியாயம் 10 : விபூதி யோகம்",
            "அத்தியாயம் 11: விஸ்வரூப தர்சன யோகம்",
            "அத்தியாயம் 12 : பக்தி யோகம்",
            "அத்தியாயம் 13 : சேஷத்ர சேஷத்ரக்கு விபாக யோகம்",
            "அத்தியாயம் 14 : குணத்ரய விபாக யோகம்",
            "அத்தியாயம் 15 : புருஷோத்தம யோகம்",
            "அத்தியாயம் 16 : தெய்வாசுர சம்பத் விபாக யோகம்",
            "அத்தியாயம் 17 : ஸ்ரத்தாத்ரய விபாக யோகம்",
            "அத்தியாயம் 18 : மோக்ஷ சந்நியாச யோகம்"};

    public static final String[] BG_TE = {"1 వ అధ్యాయము - అర్జున విషాద యోగము",
            "2 వ అధ్యాయము - సాంఖ్య యోగము",
            "3 వ అధ్యాయము - కర్మ యోగము",
            "4 వ అధ్యాయము - జ్ఞానకర్మసన్యాస యోగము",
            "5 వ అధ్యాయము - సన్యాస యోగము",
            "6 వ అధ్యాయము - ధ్యాన యోగము",
            "7 వ అధ్యాయము - జ్ఞానవిజ్ఞాన యోగము",
            "8 వ అధ్యాయము- అక్షరబ్రహ్మ యోగము",
            "9 వ అధ్యాయము - రాజవిద్యారాజగుహ్య యోగము",
            "10 వ అధ్యాయము- విభూతి యోగము",
            "11 వ అధ్యాయము - విశ్వరూప దర్శన యోగము",
            "12 వ అధ్యాయము - భక్తి యోగము",
            "13 వ అధ్యాయము - క్షేత్ర క్షేత్రజ్ఞ విభాగ యోగము ",
            "14 వ అధ్యాయము - గుణత్రయ విభాగ యోగము",
            "15 వ అధ్యాయము - పురుషోత్తమ యోగము",
            "16 వ అధ్యాయము - దైవాసుర సంపద్విభాగ యోగము ",
            "17 వ అధ్యాయము - శ్రద్ధాత్రయవిభాగ యోగమ",
            "18 వ అధ్యాయము - మోక్షసన్యాస యోగము"};

    public static final String[] CMTA = {"லஹரியே சர்வம்", "தேவ ஜனங்களே பாடுங்கள்", "என்னை படைத்த தேவனே"};

    public static final String[] CMTE = {"లహరియే సర్వం", "దేవా జనమా పాడుడి దేవా సమూహమా స్తుతించుడి", "మహోన్నతుడా", "నాధా నాధా ప్రాణనాధా క్రీస్తురాజా లహరి దేవా"};

    private static final Map<String, String[]> INDEX_MAP = new HashMap<>();

    static {
        INDEX_MAP.put(BookNameConstants.BookKey.SOFR, SofR);
        INDEX_MAP.put(BookNameConstants.BookKey.SOFRII, SofRII);
        INDEX_MAP.put(BookNameConstants.BookKey.IG, IG);
        INDEX_MAP.put(BookNameConstants.BookKey.ES, ES);
        INDEX_MAP.put(BookNameConstants.BookKey.EC, EC);
        INDEX_MAP.put(BookNameConstants.BookKey.GHc, GHc);
        INDEX_MAP.put(BookNameConstants.BookKey.HS, HS);
        INDEX_MAP.put(BookNameConstants.BookKey.GN, GN);
        INDEX_MAP.put(BookNameConstants.BookKey.LN, LN);
        INDEX_MAP.put(BookNameConstants.BookKey.PS, PS);
        INDEX_MAP.put(BookNameConstants.BookKey.HP, HP);
        INDEX_MAP.put(BookNameConstants.BookKey.LK, LK);
        INDEX_MAP.put(BookNameConstants.BookKey.PK, PKG);
        INDEX_MAP.put(BookNameConstants.BookKey.OTSC, OTSC);
        INDEX_MAP.put(BookNameConstants.BookKey.OTSE, OTSE);
        INDEX_MAP.put(BookNameConstants.BookKey.OTSM, OTSM);
        INDEX_MAP.put(BookNameConstants.BookKey.OTST, OTST);
        INDEX_MAP.put(BookNameConstants.BookKey.OTS, OTS);
        INDEX_MAP.put(BookNameConstants.BookKey.BG_E, BG_E);
        INDEX_MAP.put(BookNameConstants.BookKey.BG_TA, BG_T);
        INDEX_MAP.put(BookNameConstants.BookKey.BG_TE, BG_TE);
        INDEX_MAP.put(BookNameConstants.BookKey.CMTA, CMTA);
        INDEX_MAP.put(BookNameConstants.BookKey.CMTE, CMTE);
    }

    public static String[] getIndex(String bookKey) {
        return INDEX_MAP.get(bookKey);
    }

    public enum BookType {
        SONGS(1, "SONGS_BOOKS"), SCRIPT(2, "SCRIPTURES_BOOKS");

        private final String name;
        private final int id;

        BookType(int id, String name) {
            this.name = name;
            this.id = id;
        }

        public static BookType getType(int id) {
            switch (id) {
                case 1:
                    return SONGS;
                case 2:
                    return SCRIPT;
                default:
                    return null;
            }
        }

        public String getName() {
            return name;
        }

        public int getId() {
            return id;
        }
    }
}
